Repository: minios-linux/minios-session-manager
Catalog: po/*.po
Languages: es, fr, it

source: Insufficient disk space: {} MB required, {} MB available
es: Espacio en disco insuficiente: {} MB requeridos, {} MB disponibles
fr: Espace disque insuffisant : {} Mo requis, {} Mo disponibles
it: Spazio su disco insufficiente: {} MB richiesti, {} MB disponibili

source: Sessions directory not found
es: Directorio de sesiones no encontrado
fr: Répertoire des sessions introuvable
it: Directory delle sessioni non trovata

source: Sessions directory does not exist
es: El directorio de sesiones no existe
fr: Le répertoire des sessions n'existe pas
it: La directory delle sessioni non esiste

source: Directory is on a SquashFS filesystem (read-only)
es: El directorio está en un sistema de archivos SquashFS (solo lectura)
fr: Le répertoire est sur un système de fichiers SquashFS (lecture seule)
it: La directory è su un filesystem SquashFS (sola lettura)

source: Permission denied: {}
es: Permiso denegado: {}
fr: Permission refusée : {}
it: Permesso negato: {}

source: Error checking directory: {}
es: Error al comprobar el directorio: {}
fr: Erreur lors de la vérification du répertoire : {}
it: Errore durante il controllo della directory: {}

source: Failed to determine filesystem information
es: No se pudo determinar la información del sistema de archivos
fr: Échec de la détermination des informations du système de fichiers
it: Impossibile determinare le informazioni sul filesystem

source: Invalid df output
es: Salida de df inválida
fr: Sortie df invalide
it: Output 'df' non valido

source: Cannot parse filesystem information
es: No se puede analizar la información del sistema de archivos
fr: Impossible d'analyser les informations du système de fichiers
it: Impossibile analizzare le informazioni sul filesystem

source: Error detecting filesystem: {}
es: Error al detectar el sistema de archivos: {}
fr: Erreur lors de la détection du système de fichiers : {}
it: Errore durante il rilevamento del filesystem: {}

source: Failed to create dynfilefs virtual file
es: No se pudo crear el archivo virtual dynfilefs
fr: Échec de la création du fichier virtuel dynfilefs
it: Impossibile creare il file virtuale dynfilefs

source: Failed to format dynfilefs virtual file: {}
es: No se pudo formatear el archivo virtual dynfilefs: {}
fr: Échec du formatage du fichier virtuel dynfilefs : {}
it: Impossibile formattare il file virtuale dynfilefs: {}

source: DynFileFS session created successfully
es: Sesión DynFileFS creada con éxito
fr: Session DynFileFS créée avec succès
it: Sessione DynFileFS creata con successo

source: Error creating dynfilefs session: {}
es: Error al crear la sesión dynfilefs: {}
fr: Erreur lors de la création de la session dynfilefs : {}
it: Errore durante la creazione della sessione dynfilefs: {}

source: Session {} does not exist
es: La sesión {} no existe
fr: La session {} n'existe pas
it: La sessione {} non esiste

source: Session {} activated (was session {})
es: Sesión {} activada (era sesión {})
fr: Session {} activée (était la session {})
it: Sessione {} attivata (era sessione {})

source: Session {} activated
es: Sesión {} activada
fr: Session {} activée
it: Sessione {} attivata

source: Failed to update session metadata
es: No se pudieron actualizar los metadatos de la sesión
fr: Échec de la mise à jour des métadonnées de session
it: Impossibile aggiornare i metadati della sessione

source: Error activating session: {}
es: Error al activar la sesión: {}
fr: Erreur lors de l'activation de la session : {}
it: Errore durante l'attivazione della sessione: {}

source: Invalid session mode. Must be one of: {}
es: Modo de sesión inválido. Debe ser uno de: {}
fr: Mode de session invalide. Doit être l'un des suivants : {}
it: Modalità sessione non valida. Deve essere una tra: {}

source: Sessions directory is not writable
es: Directorio de sesiones no es escribible
fr: Le répertoire des sessions n'est pas accessible en écriture
it: La directory delle sessioni non è scrivibile

source: Native mode is not compatible with {} filesystem. Use dynfilefs or raw mode instead.
es: El modo nativo no es compatible con el sistema de archivos {}. Use el modo dynfilefs o raw en su lugar.El modo nativo no es compatible con el sistema de archivos {}. Use el modo dynfilefs o raw en su lugar.
fr: Le mode natif n'est pas compatible avec le système de fichiers {}. Utilisez plutôt le mode dynfilefs ou raw.
it: La modalità nativa non è compatibile con il filesystem {}. Usa invece la modalità dynfilefs o raw.

source: Session mode '{}' is not compatible with {} filesystem
es: El modo de sesión '{}' no es compatible con el sistema de archivos {}
fr: Le mode de session '{}' n'est pas compatible avec le système de fichiers {}
it: La modalità sessione '{}' non è compatibile con il filesystem {}

source: Raw image size {}MB exceeds FAT32 file size limit ({}MB). Use dynfilefs mode or smaller size.
es: El tamaño de la imagen raw de {}MB excede el límite de tamaño de archivo de FAT32 ({}MB). Use el modo dynfilefs o un tamaño menor.
fr: La taille de l'image brute de {} Mo dépasse la limite de taille de fichier FAT32 ({} Mo). Utilisez le mode dynfilefs ou une taille plus petite.
it: La dimensione dell'immagine raw {}MB supera il limite di dimensione file FAT32 ({}MB). Usa la modalità dynfilefs o una dimensione inferiore.

source: DynFileFS is not available on this system. Please install dynfilefs package.
es: DynFileFS no está disponible en este sistema. Por favor, instale el paquete dynfilefs.
fr: DynFileFS n'est pas disponible sur ce système. Veuillez installer le paquet dynfilefs.
it: DynFileFS non è disponibile su questo sistema. Si prega di installare il pacchetto dynfilefs.

source: Failed to format raw image file: {}
es: No se pudo formatear el archivo de imagen raw: {}
fr: Échec du formatage du fichier image brut : {}
it: Impossibile formattare il file immagine raw: {}

source: Failed to create raw image file: {}
es: No se pudo crear el archivo de imagen raw: {}
fr: Échec de la création du fichier image brut : {}
it: Impossibile creare il file immagine raw: {}

source: Session {} created successfully (mode: {}, size: {}MB)
es: Sesión {} creada con éxito (modo: {}, tamaño: {}MB)
fr: Session {} créée avec succès (mode : {}, taille : {} Mo)
it: Sessione {} creata con successo (modalità: {}, dimensione: {}MB)

source: Session {} created successfully (mode: {})
es: Sesión {} creada con éxito (modo: {})
fr: Session {} créée avec succès (mode : {})
it: Sessione {} creata con successo (modalità: {})

source: Error creating session: {}
es: Error al crear la sesión: {}
fr: Erreur lors de la création de la session : {}
it: Errore durante la creazione della sessione: {}

source: Cannot delete currently active session
es: No se puede eliminar la sesión actualmente activa
fr: Impossible de supprimer la session active
it: Impossibile eliminare la sessione attualmente attiva

source: Cannot delete currently running session
es: No se puede eliminar la sesión actualmente en ejecución
fr: Impossible de supprimer la session en cours d'exécution
it: Impossibile eliminare la sessione attualmente in esecuzione

source: Session {} deleted successfully
es: Sesión {} eliminada con éxito
fr: Session {} supprimée avec succès
it: Sessione {} eliminata con successo

source: Error deleting session: {}
es: Error al eliminar la sesión: {}
fr: Erreur lors de la suppression de la session : {}
it: Errore durante l'eliminazione della sessione: {}

source: Resize is only supported for dynfilefs and raw mode sessions
es: El redimensionamiento solo es compatible con sesiones en modo dynfilefs y raw
fr: Le redimensionnement n'est pris en charge que pour les sessions dynfilefs et raw
it: Il ridimensionamento è supportato solo per le sessioni in modalità dynfilefs e raw

source: Cannot resize currently running session
es: No se puede redimensionar la sesión actualmente en ejecución
fr: Impossible de redimensionner la session actuellement en cours d'exécution
it: Impossibile ridimensionare la sessione attualmente in esecuzione

source: Error resizing session: {}
es: Error al redimensionar la sesión: {}
fr: Erreur lors du redimensionnement de la session : {}
it: Errore durante il ridimensionamento della sessione: {}

source: DynFileFS changes.dat file not found
es: No se encontró el archivo changes.dat de DynFileFS
fr: Fichier changes.dat DynFileFS introuvable
it: File changes.dat di DynFileFS non trovato

source: New size must be larger than current total size ({}MB)
es: El nuevo tamaño debe ser mayor que el tamaño total actual ({}MB)
fr: La nouvelle taille doit être supérieure à la taille totale actuelle ({} Mo)
it: La nuova dimensione deve essere maggiore della dimensione totale attuale ({}MB)

source: New size must be larger than used size ({}MB)
es: El nuevo tamaño debe ser mayor que el tamaño usado ({}MB)
fr: La nouvelle taille doit être supérieure à la taille utilisée ({} Mo)
it: La nuova dimensione deve essere maggiore della dimensione attualmente utilizzata ({}MB)

source: Failed to create/resize virtual.dat file
es: No se pudo crear/redimensionar el archivo virtual.dat
fr: Échec de la création ou du redimensionnement du fichier virtual.dat
it: Impossibile creare/ridimensionare il file virtual.dat

source: Failed to resize filesystem: {}
es: No se pudo redimensionar el sistema de archivos: {}
fr: Échec du redimensionnement du système de fichiers : {}
it: Impossibile ridimensionare il filesystem: {}

source: Session {} resized to {}MB successfully
es: Sesión {} redimensionada a {}MB con éxito
fr: Session {} redimensionnée avec succès à {} Mo
it: Sessione {} ridimensionata con successo a {}MB

source: Failed to resize dynfilefs session: {}
es: No se pudo redimensionar la sesión dynfilefs: {}
fr: Échec du redimensionnement de la session dynfilefs : {}
it: Impossibile ridimensionare la sessione dynfilefs: {}

source: Raw image file not found
es: No se encontró el archivo de imagen raw
fr: Fichier image brut introuvable
it: File immagine raw non trovato

source: New size must be larger than current size ({}MB)
es: El nuevo tamaño debe ser mayor que el tamaño actual ({}MB)
fr: La nouvelle taille doit être supérieure à la taille actuelle ({} Mo)
it: La nuova dimensione deve essere maggiore della dimensione corrente ({}MB)

source: Failed to resize raw session: {}
es: No se pudo redimensionar la sesión raw: {}
fr: Échec du redimensionnement de la session raw : {}
it: Impossibile ridimensionare la sessione raw: {}

source: Session #{} not found
es: Sesión #{} no encontrada
fr: Session #{} introuvable
it: Sessione #{} non trovata

source: Cannot export currently running session
es: No se puede exportar la sesión actualmente en ejecución
fr: Impossible d'exporter la session en cours d'exécution
it: Impossibile esportare la sessione attualmente in esecuzione

source: Export verification failed
es: Falló la verificación de exportación
fr: Échec de la vérification de l'exportation
it: Verifica esportazione fallita

source: Session exported successfully to {} ({})
es: Sesión exportada con éxito a {} ({})
fr: Session exportée avec succès vers {} ({})
it: Sessione esportata con successo in {} ({})

source: Export failed: {}
es: Exportación fallida: {}
fr: Échec de l'exportation : {}
it: Esportazione fallita: {}

source: zstd not found. Please install zstd package.
es: zstd no encontrado. Por favor, instale el paquete zstd.
fr: zstd introuvable. Veuillez installer le paquet zstd.
it: zstd non trovato. Si prega di installare il pacchetto zstd.

source: Unknown session mode: {}
es: Modo de sesión desconocido: {}
fr: Mode de session inconnu : {}
it: Modalità sessione sconosciuta: {}

source: DynFileFS container not found
es: Contenedor DynFileFS no encontrado
fr: Conteneur DynFileFS introuvable
it: File changes.dat di DynFileFS non trovato

source: dynfilefs not found. Cannot extract dynfilefs session.
es: dynfilefs no encontrado. No se puede extraer la sesión dynfilefs.
fr: dynfilefs introuvable. Impossible d'extraire la session dynfilefs.
it: dynfilefs non trovato. Impossibile estrarre la sessione dynfilefs.

source: Failed to mount dynfilefs
es: No se pudo montar dynfilefs
fr: Échec du montage de dynfilefs
it: Impossibile montare dynfilefs

source: Failed to mount virtual file
es: No se pudo montar el archivo virtual
fr: Échec du montage du fichier virtuel
it: Impossibile montare il file virtuale

source: Raw image not found
es: Imagen raw no encontrada
fr: Image brute introuvable
it: File immagine raw non trovato

source: Failed to mount raw image
es: No se pudo montar la imagen raw
fr: Échec du montage de l'image brute
it: Impossibile montare l'immagine raw

source: Archive file not found
es: Archivo de archivo no encontrado
fr: Fichier archive introuvable
it: File di archivio non trovato

source: Invalid archive format. Only .tar.zst files are supported.
es: Formato de archivo inválido. Solo se admiten archivos .tar.zst.
fr: Format d'archive invalide. Seuls les fichiers .tar.zst sont pris en charge.
it: Formato archivio non valido. Sono supportati solo i file .tar.zst.

source: Invalid session archive: missing or corrupted metadata
es: Archivo de sesión inválido: metadatos faltantes o corruptos
fr: Archive de session invalide : métadonnées manquantes ou corrompues
it: Archivio sessione non valido: metadati mancanti o corrotti

source: Incompatible session: {}
es: Sesión incompatible: {}
fr: Session incompatible : {}
it: Sessione incompatibile: {}

source: Failed to import session data
es: No se pudieron importar los datos de la sesión
fr: Échec de l'importation des données de session
it: Impossibile importare i dati della sessione

source: Imported session failed verification
es: La sesión importada no pasó la verificación
fr: La session importée n'a pas passé la vérification
it: La sessione importata ha fallito la verifica

source: Session imported successfully as #{}
es: Sesión importada con éxito como #{}
fr: Session importée avec succès en tant que #{}
it: Sessione importata con successo come #{}

source: Import failed: {}
es: Importación fallida: {}
fr: Échec de l'importation : {}
it: Importazione fallita: {}

source: Version mismatch: {} → {}
es: Discrepancia de versión: {} → {}
fr: Incompatibilité de version : {} → {}
it: Discrepanza versione: {} → {}

source: Edition mismatch: {} → {}
es: Discrepancia de edición: {} → {}
fr: Incompatibilité d'édition : {} → {}
it: Discrepanza edizione: {} → {}

source: Union FS mismatch: {} → {}
es: Discrepancia de sistema Unión: {} → {}
fr: Incompatibilité du système Union : {} → {}
it: Discrepanza Union FS: {} → {}

source: dynfilefs not found. Cannot create dynfilefs session.
es: dynfilefs no encontrado. No se puede crear la sesión dynfilefs.
fr: dynfilefs introuvable. Impossible de créer une session dynfilefs.
it: dynfilefs non trovato. Impossibile creare la sessione dynfilefs.

source: Failed to create dynfilefs
es: No se pudo crear dynfilefs
fr: Échec de la création de dynfilefs
it: Impossibile creare il file virtuale dynfilefs

source: Failed to format dynfilefs
es: No se pudo formatear dynfilefs
fr: Échec du formatage de dynfilefs
it: Impossibile formattare il file virtuale dynfilefs

source: Failed to create raw image: {}
es: No se pudo crear la imagen raw: {}
fr: Échec de la création de l'image brute : {}
it: Impossibile creare il file immagine raw: {}

source: Failed to format raw image
es: No se pudo formatear la imagen raw
fr: Échec du formatage de l'image brute
it: Impossibile formattare il file immagine raw

source: Source session not found
es: Sesión de origen no encontrada
fr: Session source introuvable
it: Sessione di origine non trovata

source: Cannot copy currently running session
es: No se puede copiar la sesión actualmente en ejecución
fr: Impossible de copier la session en cours d'exécution
it: Impossibile copiare la sessione attualmente in esecuzione

source: Failed to copy session data
es: No se pudieron copiar los datos de la sesión
fr: Échec de la copie des données de session
it: Impossibile copiare i dati della sessione

source: Session copied successfully to #{}
es: Sesión copiada con éxito a #{}
fr: Session copiée avec succès vers #{}
it: Sessione copiata con successo in #{}

source: Copy failed: {}
es: Copia fallida: {}
fr: Échec de la copie : {}
it: Copia fallita: {}

source: Session not found
es: Sesión no encontrada
fr: Session introuvable
it: Sessione non trovata

source: Session is already in {} mode
es: La sesión ya está en modo {}
fr: La session est déjà en mode {}
it: La sessione è già in modalità {}

source: Cannot convert currently running session
es: No se puede convertir la sesión actualmente en ejecución
fr: Impossible de convertir la session en cours d'exécution
it: Impossibile convertire la sessione attualmente in esecuzione

source: Cannot convert currently active session. Please activate another session first.
es: No se puede convertir la sesión actualmente activa. Por favor, active otra sesión primero.
fr: Impossible de convertir la session actuellement active. Veuillez d'abord activer une autre session.
it: Impossibile convertire la sessione attualmente attiva. Si prega di attivare un'altra sessione prima.

source: Target mode '{}' is not compatible with current filesystem
es: El modo de destino '{}' no es compatible con el sistema de archivos actual
fr: Le mode cible '{}' n'est pas compatible avec le système de fichiers actuel
it: La modalità di destinazione '{}' non è compatibile con il filesystem corrente

source: Failed to convert session structure
es: No se pudo convertir la estructura de la sesión
fr: Échec de la conversion de la structure de session
it: Impossibile convertire la struttura della sessione

source: Build session error: {}
es: Error al crear la sesión: {}
fr: Erreur de construction de session : {}
it: Errore di creazione della sessione: {}

source: Session converted successfully from {} to {}
es: Sesión convertida con éxito de {} a {}
fr: Session convertie avec succès de {} à {}
it: Sessione convertita con successo da {} a {}

source: Conversion failed: {}
es: Conversión fallida: {}
fr: Échec de la conversion : {}
it: Conversione fallita: {}

source: Conversion error: {}
es: Error de conversión: {}
fr: Erreur de conversion : {}
it: Errore di conversione: {}

source: No sessions found
es: No se encontraron sesiones
fr: Aucune session trouvée
it: Nessuna sessione trovata

source: ACTIVE
es: ACTIVA
fr: ACTIF
it: ATTIVA

source: RUNNING
es: EN EJECUCIÓN
fr: EN COURS D'EXÉCUTION
it: IN ESECUZIONE

source: This tool requires root privileges. Please run with sudo or through pkexec.
es: Esta herramienta requiere privilegios de root. Por favor, ejecute con sudo o a través de pkexec.
fr: Cet outil nécessite des privilèges root. Veuillez l'exécuter avec sudo ou via pkexec.
it: Questo strumento richiede privilegi di root. Esegui con sudo o tramite pkexec.

source: MiniOS Session Manager - Command line tool for managing persistent sessions
es: MiniOS Session Manager - Herramienta de línea de comandos para gestionar sesiones persistentes
fr: Gestionnaire de sessions MiniOS - Outil en ligne de commande pour la gestion des sessions persistantes
it: MiniOS Session Manager - Strumento da riga di comando per la gestione delle sessioni persistenti
