Repository: minios-linux/minios-session-manager
Catalog: po/*.po
Languages: es, fr, it

source: Read-only: {}
es: Solo lectura: {}
fr: Lecture seule : {}
it: Sola lettura: {}

source: Yes
es: Sí
fr: Oui
it: Sì

source: POSIX Compatible: {}
es: Compatible con POSIX: {}
fr: Compatible POSIX : {}
it: Compatibile POSIX: {}

source: Compatible Session Modes:
es: Modos de sesión compatibles:
fr: Modes de session compatibles :
it: Modalità Sessione Compatibili:

source: None (read-only media)
es: Ninguno (medios de solo lectura)
fr: Aucun (support en lecture seule)
it: Nessuno (media di sola lettura)

source: Filesystem Limitations:
es: Limitaciones del sistema de archivos:
fr: Limitations du système de fichiers :
it: Limitazioni del Filesystem:

source: • Maximum file size: {}MB ({:.1f}GB)
es: • Tamaño máximo de archivo: {}MB ({:.1f}GB)
fr: • Taille maximale des fichiers : {} Mo ({:.1f} Go)
it: • Dimensione massima file: {}MB ({:.1f}GB)

source: • No POSIX features (no native mode support)
es: • Sin características POSIX (sin soporte de modo nativo)
fr: • Aucune fonctionnalité POSIX (pas de prise en charge du mode natif)
it: • Nessuna funzionalità POSIX (nessun supporto per la modalità nativa)

source: • Case-insensitive filenames
es: • Nombres de archivo que no distinguen entre mayúsculas y minúsculas
fr: • Noms de fichiers insensibles à la casse
it: • Nomi file non sensibili alle maiuscole/minuscole

source: No known limitations
es: Sin limitaciones conocidas
fr: Aucune limitation connue
it: Nessuna limitazione nota

source: Cleanup completed: {} sessions deleted
es: Limpieza completada: {} sesiones eliminadas
fr: Nettoyage terminé : {} sessions supprimées
it: Pulizia completata: {} sessioni eliminate

source: Errors:
es: Errores:
fr: Erreurs :
it: Errori:

source: Sessions directory: {}
es: Directorio de sesiones: {}
fr: Répertoire des sessions : {}
it: Directory delle sessioni: {}

source: Found
es: Encontrado
fr: Trouvé
it: Trovata

source: Access: {}
es: Acceso: {}
fr: Accès : {}
it: Accesso: {}

source: Writable
es: Escribible
fr: Écriture autorisée
it: Scrivibile

source: Read-only
es: Solo lectura
fr: Lecture seule
it: Sola lettura

source: Reason: {}
es: Razón: {}
fr: Raison : {}
it: Motivo: {}

source: Filesystem type: {}
es: Tipo de sistema de archivos: {}
fr: Type de système de fichiers : {}
it: Tipo di filesystem: {}

source: Not found
es: No encontrado
fr: Non trouvé
it: Non trovata

source: Command timed out - authentication may have been cancelled
es: Comando agotado - la autenticación pudo haber sido cancelada
fr: Délai d'attente de la commande expiré - l'authentification a peut-être été annulée
it: Comando scaduto - l'autenticazione potrebbe essere stata annullata

source: Sessions directory is writable
es: Directorio de sesiones es escribible
fr: Le répertoire des sessions est accessible en écriture
it: La directory delle sessioni è scrivibile

source: Sessions directory is read-only
es: Directorio de sesiones es de solo lectura
fr: Le répertoire des sessions est en lecture seule
it: La directory delle sessioni è di sola lettura

source: MiniOS Session Manager
fr: Gestionnaire de sessions MiniOS
it: Gestore Sessioni MiniOS

source: Loading sessions...
es: Cargando sesiones...
fr: Chargement des sessions...
it: Caricamento sessioni...

source: Create
es: Crear
fr: Créer
it: Crea

source: Import
es: Importar
fr: Importer
it: Importa

source: Cleanup
es: Limpiar
fr: Nettoyer
it: Pulizia

source: Error fetching session data: {}
es: Error al obtener datos de la sesión: {}
fr: Erreur lors de la récupération des données de session : {}
it: Errore durante il recupero dei dati della sessione: {}

source: Failed to get session list: {}
es: No se pudo obtener la lista de sesiones: {}
fr: Échec de l'obtention de la liste des sessions : {}
it: Impossibile ottenere l'elenco delle sessioni: {}

source: Failed to parse session list JSON: {}
es: No se pudo analizar el JSON de la lista de sesiones: {}
fr: Échec de l'analyse du JSON de la liste des sessions : {}
it: Impossibile analizzare il JSON dell'elenco sessioni: {}

source: Session
es: Sesión
it: Sessione

source: Mode:
es: Modo:
it: Modalità:

source: Version:
es: Versión:
it: Versione:

source: Edition:
es: Edición:
fr: Édition:
it: Edizione:

source: Union FS:
es: Sistema Unión:
fr: Système Union:
it: Sistema Union:

source: Size:
es: Tamaño:
fr: Taille :
it: Dimensione:

source: Modified:
es: Modificado:
fr: Modifié le :
it: Modificato:

source: AVAILABLE
es: DISPONIBLE
fr: DISPONIBLE
it: DISPONIBILE

source: Activate Session
es: Activar sesión
fr: Activer la session
it: Attiva Sessione

source: Resize Session
es: Redimensionar sesión
fr: Redimensionner la session
it: Ridimensiona Sessione

source: Export Session
es: Exportar sesión
fr: Exporter la session
it: Esporta Sessione

source: Copy Session
es: Copiar sesión
fr: Copier la session
it: Copia Sessione

source: Convert Session
es: Convertir sesión
fr: Convertir la session
it: Converti Sessione

source: Open Folder
es: Abrir carpeta
fr: Ouvrir le dossier
it: Apri Cartella

source: Delete Session
es: Eliminar sesión
fr: Supprimer la session
it: Elimina Sessione

source: Session folder not found
es: Carpeta de sesión no encontrada
fr: Dossier de session introuvable
it: Cartella sessione non trovata

source: Failed to get session information
es: No se pudo obtener la información de la sesión
fr: Échec de l'obtention des informations de session
it: Impossibile ottenere le informazioni sulla sessione

source: Failed to open folder: {}
es: No se pudo abrir la carpeta: {}
fr: Échec de l'ouverture du dossier : {}
it: Impossibile aprire la cartella: {}

source: Sessions directory is not writable. Cannot create new sessions.
es: El directorio de sesiones no es escribible. No se pueden crear nuevas sesiones.
fr: Le répertoire des sessions n'est pas accessible en écriture. Impossible de créer de nouvelles sessions.
it: La directory delle sessioni non è scrivibile. Impossibile creare nuove sessioni.

source: Create New Session
es: Crear nueva sesión
fr: Créer une nouvelle session
it: Crea Nuova Sessione

source: Detected filesystem:
es: Sistema de archivos detectado:
fr: Système de fichiers détecté :
it: Filesystem rilevato:

source: Select session mode:
es: Seleccionar modo de sesión:
fr: Sélectionner le mode de session :
it: Seleziona modalità sessione:

source: Native Mode
es: Modo nativo
fr: Mode natif
it: Modalità Nativa

source: Direct storage on POSIX filesystems
es: Almacenamiento directo en sistemas de archivos POSIX
fr: Stockage direct sur les systèmes de fichiers POSIX
it: Archiviazione diretta su filesystem POSIX

source: Native Mode (not compatible)
es: Modo nativo (no compatible)
fr: Mode natif (non compatible)
it: Modalità Nativa (non compatibile)

source: Not available: requires POSIX filesystem
es: No disponible: requiere sistema de archivos POSIX
fr: Non disponible : nécessite un système de fichiers POSIX
it: Non disponibile: richiede filesystem POSIX

source: DynFileFS Mode
es: Modo DynFileFS
fr: Mode DynFileFS
it: Modalità DynFileFS

source: Dynamic files
es: Archivos dinámicos
fr: Fichiers dynamiques
it: File dinamici

source: Raw Mode
es: Modo Raw
fr: Mode brut
it: Modalità Raw

source: Static image files
es: Archivos de imagen estáticos
fr: Fichiers image statiques
it: File immagine statici

source: Size (MB):
es: Tamaño (MB):
fr: Taille (Mo) :
it: Dimensione (MB):

source: (Only used for DynFileFS and Raw modes)
es: (Solo se usa para los modos DynFileFS y Raw)
fr: (Utilisé uniquement pour les modes DynFileFS et Raw)
it: (Usato solo per le modalità DynFileFS e Raw)

source: (Maximum {}MB on FAT32)
es: (Máximo {}MB en FAT32)
fr: (Maximum {} Mo sur FAT32)
it: (Massimo {}MB su FAT32)

source: Creating new session, please wait...
es: Creando nueva sesión, por favor espere...
fr: Création d'une nouvelle session, veuillez patienter...
it: Creazione nuova sessione, attendere prego...

source: Sessions directory is not writable. Cannot activate sessions.
es: El directorio de sesiones no es escribible. No se pueden activar sesiones.
fr: Le répertoire des sessions n'est pas accessible en écriture. Impossible d'activer les sessions.
it: La directory delle sessioni non è scrivibile. Impossibile attivare le sessioni.

source: Activating session, please wait...
es: Activando sesión, por favor espere...
fr: Activation de la session, veuillez patienter...
it: Attivazione sessione, attendere prego...

source: Session activated successfully
es: Sesión activada con éxito
fr: Session activée avec succès
it: Sessione attivata con successo

source: Failed to activate session
es: No se pudo activar la sesión
fr: Échec de l'activation de la session
it: Impossibile attivare la sessione

source: Sessions directory is not writable. Cannot delete sessions.
es: El directorio de sesiones no es escribible. No se pueden eliminar sesiones.
fr: Le répertoire des sessions n'est pas accessible en écriture. Impossible de supprimer les sessions.
it: La directory delle sessioni non è scrivibile. Impossibile eliminare le sessioni.

source: Delete this session?
es: ¿Eliminar esta sesión?
fr: Supprimer cette session ?
it: Eliminare questa sessione?

source: You're about to permanently delete session #{}. This action cannot be undone and all data in this session will be lost forever. Are you absolutely sure you want to proceed?
es: Está a punto de eliminar permanentemente la sesión #{}. Esta acción no se puede deshacer y todos los datos de esta sesión se perderán para siempre. ¿Está absolutamente seguro de que desea continuar?
fr: Vous êtes sur le point de supprimer définitivement la session #{}. Cette action est irréversible et toutes les données de cette session seront perdues à jamais. Êtes-vous absolument sûr de vouloir continuer ?
it: Stai per eliminare definitivamente la sessione #{}. Questa azione non può essere annullata e tutti i dati di questa sessione andranno persi per sempre. Sei assolutamente sicuro di voler procedere?

source: Yes, delete it
es: Sí, eliminarla
fr: Oui, supprimer
it: Sì, eliminala

source: Keep it safe
es: Mantenerla a salvo
fr: Garder en sécurité
it: Mantienila al sicuro

source: Deleting session, please wait...
es: Eliminando sesión, por favor espere...
fr: Suppression de la session, veuillez patienter...
it: Eliminazione sessione, attendere prego...

source: Session deleted successfully
es: Sesión eliminada con éxito
fr: Session supprimée avec succès
it: Sessione eliminata con successo

source: Failed to delete session
es: No se pudo eliminar la sesión
fr: Échec de la suppression de la session
it: Impossibile eliminare la sessione

source: Sessions directory is not writable. Cannot cleanup sessions.
es: El directorio de sesiones no es escribible. No se pueden limpiar las sesiones.
fr: Le répertoire des sessions n'est pas accessible en écriture. Impossible de nettoyer les sessions.
it: La directory delle sessioni non è scrivibile. Impossibile pulire le sessioni.

source: Cleanup Old Sessions
es: Limpiar sesiones antiguas
fr: Nettoyer les anciennes sessions
it: Pulizia Vecchie Sessioni

source: Delete sessions older than how many days?
es: ¿Eliminar sesiones con más de cuántos días de antigüedad?
fr: Supprimer les sessions plus anciennes que combien de jours ?
it: Eliminare sessioni più vecchie di quanti giorni?

source: Confirm Cleanup
es: Confirmar limpieza
fr: Confirmer le nettoyage
it: Conferma Pulizia

source: This will delete all sessions older than {} days. Continue?
es: Esto eliminará todas las sesiones con más de {} días de antigüedad. ¿Continuar?
fr: Ceci supprimera toutes les sessions plus anciennes que {} jours. Continuer ?
it: Questo eliminerà tutte le sessioni più vecchie di {} giorni. Continuare?

source: Cleaning up old sessions, please wait...
es: Limpiando sesiones antiguas, por favor espere...
fr: Nettoyage des anciennes sessions, veuillez patienter...
it: Pulizia vecchie sessioni, attendere prego...

source: Cleanup completed successfully
es: Limpieza completada con éxito
fr: Nettoyage terminé avec succès
it: Pulizia completata con successo

source: Cleanup failed
es: La limpieza falló
fr: Échec du nettoyage
it: Pulizia fallita

source: Oops! Something went wrong
es: ¡Ups! Algo salió mal
fr: Oups ! Quelque chose s'est mal passé
it: Ops! Qualcosa è andato storto

source: Got it
es: Entendido
fr: Compris
it: Capito

source: Success
es: Éxito
fr: Succès
it: Successo

source: Failed to create session: {}
es: No se pudo crear la sesión: {}
fr: Échec de la création de la session : {}
it: Impossibile creare la sessione: {}

source: Cannot resize session while it is running. Resize operation is not allowed for the currently active session.
es: No se puede redimensionar la sesión mientras está en ejecución. La operación de redimensionamiento no está permitida para la sesión actualmente activa.
fr: Impossible de redimensionner la session pendant son exécution. L'opération de redimensionnement n'est pas autorisée pour la session actuellement active.
it: Impossibile ridimensionare la sessione mentre è in esecuzione. L'operazione di ridimensionamento non è consentita per la sessione attualmente attiva.

source: Failed to parse session information
es: No se pudo analizar la información de la sesión
fr: Échec de l'analyse des informations de session
it: Impossibile analizzare le informazioni della sessione

source: Resize Session {}
es: Redimensionar sesión {}
fr: Redimensionner la session {}
it: Ridimensiona Sessione {}

source: New size (MB):
es: Nuevo tamaño (MB):
fr: Nouvelle taille (Mo) :
it: Nuova dimensione (MB):

source: Resizing session, please wait...
es: Redimensionando sesión, por favor espere...
fr: Redimensionnement de la session, veuillez patienter...
it: Ridimensionamento sessione, attendere prego...

source: Resize failed
es: El redimensionamiento falló
fr: Échec du redimensionnement
it: Ridimensionamento fallito

source: Export Session {}
es: Exportar sesión {}
fr: Exporter la session {}
it: Esporta Sessione {}

source: TAR.ZSTD archives (*.tar.zst)
es: Archivos TAR.ZSTD (*.tar.zst)
fr: Archives TAR.ZSTD (*.tar.zst)
it: Archivi TAR.ZSTD (*.tar.zst)

source: All files
es: Todos los archivos
fr: Tous les fichiers
it: Tutti i file

source: Exporting session, please wait...
es: Exportando sesión, por favor espere...
fr: Exportation de la session, veuillez patienter...
it: Esportazione sessione, attendere prego...

source: Session exported successfully
es: Sesión exportada con éxito
fr: Session exportée avec succès
it: Sessione esportata con successo

source: Export failed
es: Exportación fallida
fr: Échec de l'exportation
it: Esportazione fallita

source: Sessions directory is not writable. Cannot import sessions.
es: El directorio de sesiones no es escribible. No se pueden importar sesiones.
fr: Le répertoire des sessions n'est pas accessible en écriture. Impossible d'importer les sessions.
it: La directory delle sessioni non è scrivibile. Impossibile importare sessioni.

source: Import Session
es: Importar sesión
fr: Importer une session
it: Importa Sessione

source: Import Options
es: Opciones de importación
fr: Options d'importation
it: Opzioni di importazione

source: Auto-convert to compatible mode if needed
es: Convertir automáticamente a modo compatible si es necesario
fr: Convertir automatiquement en mode compatible si nécessaire
it: Converti automaticamente in modalità compatibile se necessario

source: Force import to mode:
es: Forzar importación a modo:
fr: Forcer l'importation vers le mode :
it: Forza importazione in modalità:

source: Auto (from metadata)
es: Automático (desde metadatos)
fr: Auto (depuis les métadonnées)
it: Auto (dai metadati)

source: Importing session, please wait...
es: Importando sesión, por favor espere...
fr: Importation de la session, veuillez patienter...
it: Importazione sessione, attendere prego...

source: Session imported successfully
es: Sesión importada con éxito
fr: Session importée avec succès
it: Sessione importata con successo

source: Import failed
es: Importación fallida
fr: Échec de l'importation
it: Importazione fallita

source: Copy Session {}
es: Copiar sesión {}
fr: Copier la session {}
it: Copia Sessione {}

source: Convert to different mode
es: Convertir a modo diferente
fr: Convertir vers un mode différent
it: Converti in modalità diversa

source: Target mode:
es: Modo de destino:
fr: Mode cible :
it: Modalità di destinazione:

source: Copying session, please wait...
es: Copiando sesión, por favor espere...
fr: Copie de la session, veuillez patienter...
it: Copia sessione, attendere prego...

source: Session copied successfully
es: Sesión copiada con éxito
fr: Session copiée avec succès
it: Sessione copiata con successo

source: Copy failed
es: Copia fallida
fr: Échec de la copie
it: Copia fallita

source: Convert Session {}
es: Convertir sesión {}
fr: Convertir la session {}
it: Converti Sessione {}

source: Current mode: {}
es: Modo actual: {}
fr: Mode actuel : {}
it: Modalità attuale: {}

source: Converting session, please wait...
es: Convirtiendo sesión, por favor espere...
fr: Conversion de la session, veuillez patienter...
it: Conversione sessione, attendere prego...

source: Session converted successfully
es: Sesión convertida con éxito
fr: Session convertie avec succès
it: Sessione convertita con successo

source: Convert failed
es: Conversión fallida
fr: Échec de la conversion
it: Conversione fallita

source: No
fr: Non
