Repository: minios-linux/minios-session-manager
Catalog: po/*.po
Languages: es, fr, it

source: GLOBAL OPTIONS: --json Output results in JSON format (can be used with any command) --sessions-dir PATH Use custom sessions directory instead of default COMMANDS: list List all available sessions with detailed information active Show currently active session (will boot next) running Show currently running session (current boot) info Show filesystem type and compatible session modes activate SESSION_ID Activate specified session (required: session_id) create [OPTIONS] Create new session (optional: --mode, --size) delete SESSION_ID Delete specified session (required: session_id) cleanup [OPTIONS] Delete old sessions (optional: --days, default: 30) status Check sessions directory status and permissions resize SESSION_ID SIZE Resize session to new size in MB (dynfilefs/raw only) export SESSION_ID PATH Export session to .tar.zst archive import ARCHIVE Import session from .tar.zst archive copy SESSION_ID Copy session (optional: --to-mode, --size) convert SESSION_ID MODE Convert session to different mode (optional: --size) SESSION MODES: native Direct filesystem changes (requires POSIX-compatible filesystem) dynfilefs Dynamic file system overlay (works on any filesystem, 1000MB default) raw Raw disk image (works on any filesystem, custom size required) COMMAND BEHAVIOR: • create without --mode: Uses native mode (may fail on FAT32/NTFS/exFAT) • create without --size: Uses 1000MB for dynfilefs/raw modes • cleanup without --days: Uses 30-day threshold for deletion • cleanup protects both active and running sessions from deletion EXAMPLES: Basic Usage: minios-session list List all available sessions minios-session active Show which session will boot next minios-session running Show currently running session minios-session info Show filesystem compatibility info Session Management: minios-session activate 2 Set session #2 as default for next boot minios-session delete 3 Delete session #3 permanently minios-session cleanup --days 30 Delete sessions older than 30 days minios-session cleanup Delete sessions older than 30 days (default) Creating Sessions: minios-session create --mode native Create native session (filesystem changes) minios-session create --mode dynfilefs Create 1000MB dynfilefs session (default) minios-session create --mode dynfilefs --size 8000 Create 8000MB dynfilefs session minios-session create --mode raw --size 2000 Create 2000MB raw disk image Session Operations: minios-session resize 2 4000 Resize session #2 to 4000MB minios-session export 3 /tmp/backup.tar.zst Export session #3 to archive minios-session import /tmp/backup.tar.zst Import session from archive minios-session copy 2 Copy session #2 minios-session copy 2 --to-mode raw --size 3000 Copy session #2 as raw with 3000MB minios-session convert 3 dynfilefs --size 2000 Convert session #3 to dynfilefs with 2000MB Error Handling: minios-session create May fail on FAT32/NTFS/exFAT: "Use dynfilefs or raw mode" minios-session create --mode raw --size 5000 Will fail on FAT32: file size limit is 4096MB (4GB) JSON Output (for automation): minios-session --json list List sessions in JSON format minios-session active --json Get active session info as JSON minios-session info --json Get system info as JSON Custom Session Directory: minios-session --sessions-dir /mnt/usb/sessions list minios-session --sessions-dir /tmp/test create --mode native
es: OPCIONES GLOBALES: --json Mostrar resultados en formato JSON (puede usarse con cualquier comando) --sessions-dir PATH Usar un directorio de sesiones personalizado en lugar del predeterminado COMANDOS: list Listar todas las sesiones disponibles con información detallada active Mostrar la sesión actualmente activa (se iniciará en el próximo arranque) running Mostrar la sesión actualmente en ejecución (arranque actual) info Mostrar el tipo de sistema de archivos e información de compatibilidad de modos de sesión activate SESSION_ID Activar la sesión especificada (obligatorio: session_id) create [OPCIONES] Crear nueva sesión (opcional: --mode, --size) delete SESSION_ID Eliminar la sesión especificada (obligatorio: session_id) cleanup [OPCIONES] Eliminar sesiones antiguas (opcional: --days, predeterminado: 30) status Comprobar el estado del directorio de sesiones y permisos resize SESSION_ID SIZE Redimensionar la sesión al nuevo tamaño en MB (solo dynfilefs/raw) export SESSION_ID PATH Exportar sesión a archivo .tar.zst import ARCHIVE Importar sesión desde archivo .tar.zst copy SESSION_ID Copiar sesión (opcional: --to-mode, --size) convert SESSION_ID MODE Convertir sesión a modo diferente (opcional: --size) MODOS DE SESIÓN: native Cambios directos en el sistema de archivos (requiere un sistema de archivos compatible con POSIX) dynfilefs Superposición dinámica del sistema de archivos (funciona en cualquier sistema de archivos, 1000MB predeterminado) raw Imagen de disco raw (funciona en cualquier sistema de archivos, tamaño personalizado requerido) COMPORTAMIENTO DEL COMANDO: • create sin --mode: Usa el modo nativo (puede fallar en FAT32/NTFS/exFAT) • create sin --size: Usa 1000MB para los modos dynfilefs/raw • cleanup sin --days: Usa un umbral de 30 días para la eliminación • cleanup protege tanto las sesiones activas como las en ejecución de la eliminación EJEMPLOS: Uso Básico: minios-session list Listar todas las sesiones disponibles minios-session active Mostrar qué sesión se iniciará en el próximo arranque minios-session running Mostrar la sesión actualmente en ejecución minios-session info Mostrar información de compatibilidad del sistema de archivos Gestión de Sesiones: minios-session activate 2 Establecer la sesión #2 como predeterminada para el próximo arranque minios-session delete 3 Eliminar la sesión #3 permanentemente minios-session cleanup --days 30 Eliminar sesiones con más de 30 días de antigüedad minios-session cleanup Eliminar sesiones con más de 30 días de antigüedad (predeterminado) Creación de Sesiones: minios-session create --mode native Crear una sesión nativa (cambios en el sistema de archivos) minios-session create --mode dynfilefs Crear una sesión dynfilefs de 1000MB (predeterminado) minios-session create --mode dynfilefs --size 8000 Crear una sesión dynfilefs de 8000MB minios-session create --mode raw --size 2000 Crear una imagen de disco raw de 2000MB Operaciones de Sesión: minios-session resize 2 4000 Redimensionar sesión #2 a 4000MB minios-session export 3 /tmp/backup.tar.zst Exportar sesión #3 a archivo minios-session import /tmp/backup.tar.zst Importar sesión desde archivo minios-session copy 2 Copiar sesión #2 minios-session copy 2 --to-mode raw --size 3000 Copiar sesión #2 como raw con 3000MB minios-session convert 3 dynfilefs --size 2000 Convertir sesión #3 a dynfilefs con 2000MB Manejo de Errores: minios-session create Puede fallar en FAT32/NTFS/exFAT: "Use el modo dynfilefs o raw" minios-session create --mode raw --size 5000 Fallará en FAT32: el límite de tamaño de archivo es 4096MB (4GB) Salida JSON (para automatización): minios-session --json list Listar sesiones en formato JSON minios-session active --json Obtener información de la sesión activa como JSON minios-session info --json Obtener información del sistema como JSON Directorio de Sesiones Personalizado: minios-session --sessions-dir /mnt/usb/sessions list minios-session --sessions-dir /tmp/test create --mode native
fr: OPTIONS GLOBALES : --json Afficher les résultats au format JSON (peut être utilisé avec n'importe quelle commande) --sessions-dir PATH Utiliser un répertoire de sessions personnalisé au lieu de celui par défaut COMMANDES : list Lister toutes les sessions disponibles avec des informations détaillées active Afficher la session actuellement active (sera démarrée au prochain boot) running Afficher la session actuellement en cours (boot actuel) info Afficher le type de système de fichiers et les modes de session compatibles activate SESSION_ID Activer la session spécifiée (requis : session_id) create [OPTIONS] Créer une nouvelle session (optionnel : --mode, --size) delete SESSION_ID Supprimer la session spécifiée (requis : session_id) cleanup [OPTIONS] Supprimer les anciennes sessions (optionnel : --days, par défaut : 30) status Vérifier l'état et les permissions du répertoire des sessions resize SESSION_ID SIZE Redimensionner la session à une nouvelle taille en Mo (dynfilefs/raw uniquement) export SESSION_ID PATH Exporter la session vers une archive .tar.zst import ARCHIVE Importer une session depuis une archive .tar.zst copy SESSION_ID Copier une session (optionnel : --to-mode, --size) convert SESSION_ID MODE Convertir une session vers un mode différent (optionnel : --size) MODES DE SESSION : native Modifications directes du système de fichiers (nécessite un système de fichiers compatible POSIX) dynfilefs Superposition dynamique du système de fichiers (fonctionne sur n'importe quel système de fichiers, 1000 Mo par défaut) raw Image disque brute (fonctionne sur n'importe quel système de fichiers, taille personnalisée requise) COMPORTEMENT DES COMMANDES : • create sans --mode : Utilise le mode natif (peut échouer sur FAT32/NTFS/exFAT) • create sans --size : Utilise 1000 Mo pour les modes dynfilefs/raw • cleanup sans --days : Utilise un seuil de 30 jours pour la suppression • cleanup protège les sessions actives et en cours d'exécution de la suppression EXEMPLES : Utilisation de base : minios-session list Lister toutes les sessions disponibles minios-session active Afficher la session qui sera démarrée au prochain boot minios-session running Afficher la session actuellement en cours d'exécution minios-session info Afficher les informations de compatibilité du système de fichiers Gestion des sessions : minios-session activate 2 Définir la session #2 comme par défaut pour le prochain boot minios-session delete 3 Supprimer la session #3 définitivement minios-session cleanup --days 30 Supprimer les sessions plus anciennes que 30 jours minios-session cleanup Supprimer les sessions plus anciennes que 30 jours (par défaut) Création de sessions : minios-session create --mode native Créer une session native (modifications du système de fichiers) minios-session create --mode dynfilefs Créer une session dynfilefs de 1000 Mo (par défaut) minios-session create --mode dynfilefs --size 8000 Créer une session dynfilefs de 8000 Mo minios-session create --mode raw --size 2000 Créer une image disque brute de 2000 Mo Opérations sur les sessions : minios-session resize 2 4000 Redimensionner la session #2 à 4000 Mo minios-session export 3 /tmp/backup.tar.zst Exporter la session #3 vers une archive minios-session import /tmp/backup.tar.zst Importer une session depuis une archive minios-session copy 2 Copier la session #2 minios-session copy 2 --to-mode raw --size 3000 Copier la session #2 en mode raw avec 3000 Mo minios-session convert 3 dynfilefs --size 2000 Convertir la session #3 vers dynfilefs avec 2000 Mo Gestion des erreurs : minios-session create Peut échouer sur FAT32/NTFS/exFAT : "Utilisez le mode dynfilefs ou raw" minios-session create --mode raw --size 5000 Échouera sur FAT32 : la limite de taille de fichier est de 4096 Mo (4 Go) Sortie JSON (pour l'automatisation) : minios-session --json list Lister les sessions au format JSON minios-session active --json Obtenir les informations de la session active au format JSON minios-session info --json Obtenir les informations système au format JSON Répertoire de sessions personnalisé : minios-session --sessions-dir /mnt/usb/sessions list minios-session --sessions-dir /tmp/test create --mode native
it: OPZIONI GLOBALI: --json Output i risultati in formato JSON (può essere usato con qualsiasi comando) --sessions-dir PATH Usa una directory personalizzata per le sessioni invece di quella predefinita COMANDI: list Elenca tutte le sessioni disponibili con informazioni dettagliate active Mostra la sessione attualmente attiva (che si avvierà al prossimo boot) running Mostra la sessione attualmente in esecuzione (boot corrente) info Mostra il tipo di filesystem e le modalità di sessione compatibili activate SESSION_ID Attiva la sessione specificata (richiesto: session_id) create [OPZIONI] Crea nuova sessione (opzionale: --mode, --size) delete SESSION_ID Elimina la sessione specificata (richiesto: session_id) cleanup [OPZIONI] Elimina le vecchie sessioni (opzionale: --days, predefinito: 30) status Controlla lo stato e i permessi della directory delle sessioni resize SESSION_ID SIZE Ridimensiona la sessione a una nuova dimensione in MB (solo dynfilefs/raw) export SESSION_ID PATH Esporta la sessione in archivio .tar.zst import ARCHIVE Importa sessione da archivio .tar.zst copy SESSION_ID Copia sessione (opzionale: --to-mode, --size) convert SESSION_ID MODE Converti sessione in modalità diversa (opzionale: --size) MODALITÀ SESSIONE: native Modifiche dirette al filesystem (richiede filesystem compatibile con POSIX) dynfilefs Overlay dinamico del filesystem (funziona su qualsiasi filesystem, 1000MB predefiniti) raw Immagine disco raw (funziona su qualsiasi filesystem, dimensione personalizzata richiesta) COMPORTAMENTO DEI COMANDI: • create senza --mode: Usa la modalità nativa (potrebbe fallire su FAT32/NTFS/exFAT) • create senza --size: Usa 1000MB per le modalità dynfilefs/raw • cleanup senza --days: Usa una soglia di 30 giorni per l'eliminazione • cleanup protegge le sessioni attive e in esecuzione dall'eliminazione ESEMPI: Utilizzo Base: minios-session list Elenca tutte le sessioni disponibili minios-session active Mostra quale sessione si avvierà al prossimo boot minios-session running Mostra la sessione attualmente in esecuzione minios-session info Mostra le informazioni di compatibilità del filesystem Gestione Sessioni: minios-session activate 2 Imposta la sessione #2 come predefinita per il prossimo boot minios-session delete 3 Elimina la sessione #3 permanentemente minios-session cleanup --days 30 Elimina le sessioni più vecchie di 30 giorni minios-session cleanup Elimina le sessioni più vecchie di 30 giorni (predefinito) Creazione Sessioni: minios-session create --mode native Crea una sessione nativa (modifiche al filesystem) minios-session create --mode dynfilefs Crea una sessione dynfilefs da 1000MB (predefinita) minios-session create --mode dynfilefs --size 8000 Crea una sessione dynfilefs da 8000MB minios-session create --mode raw --size 2000 Crea un'immagine disco raw da 2000MB Operazioni Sessione: minios-session resize 2 4000 Ridimensiona la sessione #2 a 4000MB minios-session export 3 /tmp/backup.tar.zst Esporta la sessione #3 in archivio minios-session import /tmp/backup.tar.zst Importa sessione da archivio minios-session copy 2 Copia la sessione #2 minios-session copy 2 --to-mode raw --size 3000 Copia la sessione #2 come raw con 3000MB minios-session convert 3 dynfilefs --size 2000 Converti la sessione #3 a dynfilefs con 2000MB Gestione Errori: minios-session create Potrebbe fallire su FAT32/NTFS/exFAT: "Usa la modalità dynfilefs o raw" minios-session create --mode raw --size 5000 Potrebbe fallire su FAT32: il limite di dimensione file è 4096MB (4GB) Output JSON (per automazione): minios-session --json list Elenca le sessioni in formato JSON minios-session active --json Ottieni le informazioni della sessione attiva come JSON minios-session info --json Ottieni le informazioni di sistema come JSON Directory Sessioni Personalizzata: minios-session --sessions-dir /mnt/usb/sessions list minios-session --sessions-dir /tmp/test create --mode native

source: Output in JSON format
es: Mostrar resultados en formato JSON
fr: Sortie au format JSON
it: Output in formato JSON

source: Custom path to sessions directory
es: Ruta personalizada al directorio de sesiones
fr: Chemin personnalisé vers le répertoire des sessions
it: Percorso personalizzato alla directory delle sessioni

source: Available commands
es: Comandos disponibles
fr: Commandes disponibles
it: Comandi disponibili

source: List all sessions
es: Listar todas las sesiones
fr: Lister toutes les sessions
it: Elenca tutte le sessioni

source: Show active session
es: Mostrar sesión activa
fr: Afficher la session active
it: Mostra la sessione attiva

source: Show running session
es: Mostrar sesión en ejecución
fr: Afficher la session en cours d'exécution
it: Mostra la sessione in esecuzione

source: Show filesystem and compatibility information
es: Mostrar información de compatibilidad del sistema de archivos
fr: Afficher les informations sur le système de fichiers et la compatibilité
it: Mostra le informazioni sul filesystem e sulla compatibilità

source: Activate a session
es: Activar una sesión
fr: Activer une session
it: Attiva una sessione

source: Session ID to activate
es: ID de sesión a activar
fr: ID de la session à activer
it: ID della sessione da attivare

source: Create a new session
es: Crear una nueva sesión
fr: Créer une nouvelle session
it: Crea una nuova sessione

source: Session mode (default: native)
es: Modo de sesión (predeterminado: nativo)
fr: Mode de session (par défaut : natif)
it: Modalità sessione (predefinita: nativa)

source: Size in MB for dynfilefs/raw modes (default: 1000)
es: Tamaño en MB para los modos dynfilefs/raw (predeterminado: 1000)
fr: Taille en Mo pour les modes dynfilefs/raw (par défaut : 1000)
it: Dimensione in MB per le modalità dynfilefs/raw (predefinita: 1000)

source: Delete a session
es: Eliminar una sesión
fr: Supprimer une session
it: Elimina una sessione

source: Session ID to delete
es: ID de sesión a eliminar
fr: ID de la session à supprimer
it: ID della sessione da eliminare

source: Clean up old sessions
es: Limpiar sesiones antiguas
fr: Nettoyer les anciennes sessions
it: Pulizia vecchie sessioni

source: Delete sessions older than N days (default: 30)
es: Eliminar sesiones con más de N días de antigüedad (predeterminado: 30)
fr: Supprimer les sessions de plus de N jours (par défaut : 30)
it: Elimina le sessioni più vecchie di N giorni (predefinito: 30)

source: Check sessions directory status
es: Comprobar el estado del directorio de sesiones
fr: Vérifier l'état du répertoire des sessions
it: Controlla lo stato della directory delle sessioni

source: Resize a session
es: Redimensionar una sesión
fr: Redimensionner une session
it: Ridimensiona una sessione

source: Session ID to resize
es: ID de sesión a redimensionar
fr: ID de la session à redimensionner
it: ID della sessione da ridimensionare

source: New size in MB
es: Nuevo tamaño en MB
fr: Nouvelle taille en Mo
it: Nuova dimensione in MB

source: Export session to archive
es: Exportar sesión a archivo
fr: Exporter la session vers une archive
it: Esporta sessione in archivio

source: Session ID to export
es: ID de sesión a exportar
fr: ID de la session à exporter
it: ID della sessione da esportare

source: Output file or directory path
es: Ruta de archivo o directorio de salida
fr: Chemin du fichier ou du répertoire de sortie
it: Percorso del file o della directory di output

source: Skip archive verification
es: Omitir verificación de archivo
fr: Ignorer la vérification de l'archive
it: Salta la verifica dell'archivio

source: Import session from archive
es: Importar sesión desde archivo
fr: Importer une session depuis une archive
it: Importa sessione da archivio

source: Path to session archive (.tar.zst)
es: Ruta al archivo de sesión (.tar.zst)
fr: Chemin vers l'archive de session (.tar.zst)
it: Percorso dell'archivio sessione (.tar.zst)

source: Automatically convert to compatible mode
es: Convertir automáticamente a modo compatible
fr: Convertir automatiquement vers un mode compatible
it: Converti automaticamente in modalità compatibile

source: Force specific session mode
es: Forzar modo de sesión específico
fr: Forcer un mode de session spécifique
it: Forza modalità sessione specifica

source: Skip integrity verification
es: Omitir verificación de integridad
fr: Ignorer la vérification de l'intégrité
it: Salta la verifica dell'integrità

source: Skip compatibility checks
es: Omitir comprobaciones de compatibilidad
fr: Ignorer les vérifications de compatibilité
it: Salta i controlli di compatibilità

source: Copy a session
es: Copiar una sesión
fr: Copier une session
it: Copia una sessione

source: Session ID to copy
es: ID de sesión a copiar
fr: ID de la session à copier
it: ID della sessione da copiare

source: Convert to different mode (optional)
es: Convertir a modo diferente (opcional)
fr: Convertir vers un mode différent (optionnel)
it: Converti in modalità diversa (opzionale)

source: Size for new session (for dynfilefs/raw)
es: Tamaño para nueva sesión (para dynfilefs/raw)
fr: Taille pour la nouvelle session (pour dynfilefs/raw)
it: Dimensione per nuova sessione (per dynfilefs/raw)

source: Convert session mode
es: Convertir modo de sesión
fr: Convertir le mode de session
it: Converti modalità sessione

source: Session ID to convert
es: ID de sesión a convertir
fr: ID de la session à convertir
it: ID della sessione da convertire

source: Target mode
es: Modo de destino
fr: Mode cible
it: Modalità di destinazione

source: Size for dynfilefs/raw mode
es: Tamaño para modo dynfilefs/raw
fr: Taille pour le mode dynfilefs/raw
it: Dimensione per la modalità dynfilefs/raw

source: Create new session instead of in-place conversion
es: Crear nueva sesión en lugar de conversión in situ
fr: Créer une nouvelle session au lieu d'une conversion sur place
it: Crea una nuova sessione invece della conversione in loco

source: Could not find sessions directory.
es: No se pudo encontrar el directorio de sesiones.
fr: impossible de trouver le répertoire des sessions.
it: Impossibile trovare la directory delle sessioni.

source: This tool must be run from within a MiniOS live system with persistent sessions enabled.
es: Esta herramienta debe ejecutarse desde un sistema en vivo de MiniOS con sesiones persistentes habilitadas.
fr: Cet outil doit être exécuté à partir d'un système live MiniOS avec les sessions persistantes activées.
it: Questo strumento deve essere eseguito all'interno di un sistema live MiniOS con sessioni persistenti abilitate.

source: Error: Could not find sessions directory.
es: Error: No se pudo encontrar el directorio de sesiones.
fr: Erreur : impossible de trouver le répertoire des sessions.
it: Errore: Impossibile trovare la directory delle sessioni.

source: Active session: #{}
es: Sesión activa: #{}
fr: Session active : #{}
it: Sessione attiva: #{}

source: Mode: {}
es: Modo: {}
it: Modalità: {}

source: Version: {}
es: Versión: {}
it: Versione: {}

source: Edition: {}
es: Edición: {}
fr: Édition : {}
it: Edizione: {}

source: Union FS: {}
es: Sistema Unión: {}
fr: Système Union : {}
it: Sistema Union: {}

source: Size: {}
es: Tamaño: {}
fr: Taille : {}
it: Dimensione: {}

source: Last Modified: {}
es: Última modificación: {}
fr: Dernière modification : {}
it: Ultima modifica: {}

source: No active session found
es: No se encontró ninguna sesión activa
fr: Aucune session active trouvée
it: Nessuna sessione attiva trovata

source: Running session: #{}
es: Sesión en ejecución: #{}
fr: Session en cours d'exécution : #{}
it: Sessione in esecuzione: #{}

source: Status: {}
es: Estado: {}
fr: Statut : {}
it: Stato: {}

source: No running session detected
es: No se detectó ninguna sesión en ejecución
fr: Aucune session en cours d'exécution détectée
it: Nessuna sessione in esecuzione rilevata

source: Error: {}
fr: Erreur : {}
it: Errore: {}

source: MiniOS Media Information:
es: Información del medio MiniOS:
fr: Informations sur le support MiniOS :
it: Informazioni Media MiniOS:

source: Filesystem Type: {}
es: Tipo de sistema de archivos: {}
fr: Type de système de fichiers : {}
it: Tipo Filesystem: {}

source: Device: {}
es: Dispositivo: {}
fr: Périphérique : {}
it: Dispositivo: {}

source: Mount Options: {}
es: Opciones de montaje: {}
fr: Options de montage : {}
it: Opzioni di mount: {}

source: none
es: ninguno
fr: aucune
it: nessuno
